[
  {
    "name": "Alabama",
    "code": "AL",
    "registrationLink": "https://register.vote.org/?state=Alabama",
    "age": "You must be 18 years old before any election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Alabama and your county at the time of registration",
    "criminalHistory":
      "You must not have been convicted of a felony punishable by imprisonment in the penitentiary (or have had your civil and political rights restored). You must not have been convicted of treason or impeachment. If you have been convicted for murder, rape, sodomy, sexual abuse, sexual torture, enticing a child to enter a vehicle for immoral purposes, soliciting a child by computer, production of obscene matter, parents or guardians permitting children to engage in obscene matter, possession of obscene matter, or possession with intent to distribute child pornography, you must receive a pardon before voting. If you have been convicted of another felony that is listed as a crime of moral turpitude, you must seek a Certificate of Eligibility to Register to Vote. If you have another felony (such as a DUI), you ARE eligible to vote.",
    "competence":
      "You must not currently be declared mentally incompetent through a competency hearing",
    "other":
      "You must swear or affirm to \"support and defend the Constitution of the US and the State of Alabama and further disavow any belief or affiliation with any group which advocates the overthrow of the governments of the US or the State of Alabama by unlawful means and that the information contained herein is true, so help me God\""
  },
  {
    "name": "Alaska",
    "code": "AK",
    "registrationLink": "https://register.vote.org/?state=Alaska",
    "age":
      "You must be at least 18 years old within 90 days of completing this registration",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Alaska",
    "criminalHistory":
      "You must not be a convicted felon (unless unconditionally discharged)",
    "competence": "There is no competence requirement",
    "other": "You must not be registered to vote in another state"
  },
  {
    "name": "Arizona",
    "code": "AZ",
    "registrationLink": "https://register.vote.org/?state=Arizona",
    "age": "You must be 18 years old on or before the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Arizona and your county at least 29 days preceding the next election",
    "criminalHistory":
      "You must not have been convicted of treason or a felony (or have had your civil rights restored)",
    "competence":
      "You must not currently be declared an incapacitated person by a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Arkansas",
    "code": "AR",
    "registrationLink": "https://register.vote.org/?state=Arkansas",
    "age": "You must be at least 18 years old before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must live in Arkansas at the address in Box 2 on the application",
    "criminalHistory":
      "You must not be a convicted felon (or have completely discharged your sentence or been pardoned)",
    "competence":
      "You must not previously be adjudged mentally incompetent by a court of competent jurisdiction",
    "other": "There is no other requirement"
  },
  {
    "name": "California",
    "code": "CA",
    "registrationLink": "https://register.vote.org/?state=California",
    "age":
      "You must be at least 18 years of age at the time of the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of California",
    "criminalHistory":
      "You must not be imprisoned or on parole for the conviction of a felony",
    "competence":
      "You must not currently be judged mentally incompetent by a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Colorado",
    "code": "CO",
    "registrationLink": "https://register.vote.org/?state=Colorado",
    "age": "You must be 18 years old on or before Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Colorado 22 days prior to Election Day",
    "criminalHistory":
      "You must not be serving a sentence of detention, confinement, or parole for a felony conviction.",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Connecticut",
    "code": "CT",
    "registrationLink": "https://register.vote.org/?state=Connecticut",
    "age": "You must be 17 years old. You can vote when you turn 18.",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Connecticut and of the town in which you wish to vote",
    "criminalHistory":
      "You must have completed confinement and parole if previously convicted of a felony",
    "competence":
      "You must not currently be declared mentally incompetent to vote by a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Delaware",
    "code": "DE",
    "registrationLink": "https://register.vote.org/?state=Delaware",
    "age":
      "You must be at least 18 years old on the date of the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a permanent resident of Delaware",
    "criminalHistory":
      "If you are a felon, you are eligible to vote as long as you have served your sentence (including parole) and your convictions were not for disqualifying felonies: murder and manslaughter (except vehicular homicide), sexual offenses, or crimes against public administration involving bribery or improper influence or abuse of office",
    "competence": "You must not be mentally incompetent",
    "other": "There is no other requirement"
  },
  {
    "name": "District of Columbia",
    "code": "DC",
    "registrationLink": "https://register.vote.org/?state=District+of+Columbia",
    "age":
      "You must be at least 18 years old on or preceding the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a District of Columbia resident at least 30 days preceding the next election and not claim the right to vote anywhere outside DC",
    "criminalHistory": "You must not be in prison for a felony conviction",
    "competence":
      "You must not have been judged legally incompetent by a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Florida",
    "code": "FL",
    "registrationLink": "https://register.vote.org/?state=Florida",
    "age":
      "You must be 18 years old (you may pre‑register if you are at least 16)",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a legal resident of both the State of Florida and of the county in which you seek to be registered",
    "criminalHistory":
      "You must not be a convicted felon, or if you are, you must first have your civil rights restored if they were taken away",
    "competence":
      "You must not be adjudicated mentally incapacitated with respect to voting in Florida or any other State, or if you have, you must first have your voting rights restored",
    "other":
      "You must swear or affirm the following: \"I will protect and defend the Constitution of the United States and the Constitution of the State of Florida, that I am qualified to register as an elector under the Constitution and laws of the State of Florida, and that all information in this application is true.\""
  },
  {
    "name": "Georgia",
    "code": "GA",
    "registrationLink": "https://register.vote.org/?state=Georgia",
    "age":
      "You must be 18 years old within six months after the day of registration, and be 18 years old to vote",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of both Georgia and the county in which you want to vote",
    "criminalHistory":
      "You must not be serving a sentence for having been convicted of a felony involving moral turpitude",
    "competence":
      "You must not have been judicially determined to be mentally incompetent, unless the disability has been removed",
    "other": "There is no other requirement"
  },
  {
    "name": "Hawaii",
    "code": "HI",
    "registrationLink": "https://register.vote.org/?state=Hawaii",
    "age":
      "You must be at least 16 years old (you must be 18 years old by Election Day in order to vote)",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of the State of Hawaii",
    "criminalHistory": "You must not be incarcerated for a felony conviction",
    "competence":
      "You must not be adjudicated by a court as \"non compos mentis\"",
    "other": "There is no other requirement"
  },
  {
    "name": "Idaho",
    "code": "ID",
    "registrationLink": "https://register.vote.org/?state=Idaho",
    "age": "You must be at least 18 years old",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must have resided in Idaho and in the county for 30 days prior to the day of election",
    "criminalHistory":
      "You must not be serving a sentence of imprisonment for a felony. Your voting rights are restored once you have completed your sentence, probation, and parole.",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Illinois",
    "code": "IL",
    "registrationLink": "https://register.vote.org/?state=Illinois",
    "age": "You must be at least 18 years old on or before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Illinois and of your election precinct at least 30 days before the next election. You must not claim the right to vote anywhere else",
    "criminalHistory": "You must not be in jail for a felony conviction (but you can vote if you have completed your sentence)",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Indiana",
    "code": "IN",
    "registrationLink": "https://register.vote.org/?state=Indiana",
    "age":
      "You must be at least 18 years of age on the day of the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must have resided in the precinct at least 30 days before the next election",
    "criminalHistory":
      "You must not currently be incarcerated for a criminal conviction.",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Iowa",
    "code": "IA",
    "registrationLink": "https://register.vote.org/?state=Iowa",
    "age": "You must be at least 17‑1/2 years old (you must be 18 to vote)",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Iowa and not claim the right to vote in more than one place",
    "criminalHistory":
      "You must not have been convicted of a felony (or have had your rights restored)",
    "competence":
      "You must not currently be judged by a court to be \"incompetent to vote\"",
    "other": "There is no other requirement"
  },
  {
    "name": "Kansas",
    "code": "KS",
    "registrationLink": "https://register.vote.org/?state=Kansas",
    "age": "You must be 18 by the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Kansas and not claim the right to vote in any other location or under any other name",
    "criminalHistory":
      "You must have completed the terms of your sentence if convicted of a felony; a person serving a sentence for a felony conviction is ineligible to vote",
    "competence":
      "You must not be excluded from voting for mental incompetence by a court of competent jurisdiction",
    "other": "There is no other requirement"
  },
  {
    "name": "Kentucky",
    "code": "KY",
    "registrationLink": "https://register.vote.org/?state=Kentucky",
    "age": "You must be 18 years of age on or before the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Kentucky AND be a resident of the county for at least 28 days prior to Election Day date AND not claim the right to vote anywhere outside Kentucky",
    "criminalHistory":
      "You must not be a convicted felon or if you have been convicted of a felony, your civil rights must have been restored by executive pardon",
    "competence":
      "You must not have been judged \"mentally incompetent\" in a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Louisiana",
    "code": "LA",
    "registrationLink": "https://register.vote.org/?state=Louisiana",
    "age":
      "You must be at least 17 years old, and be 18 years old prior to the next election to vote",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Louisiana (Residence address must be address where you claim homestead exemption, if any, except for a resident in a nursing home or veteran’s home who may select to use the address of the nursing home or veterans’ home or the home where thier has a homestead exemption. A college student may elect to use their home address or their address while away at school.)",
    "criminalHistory":
      "You must not currently be under an order of imprisonment for conviction of a felony. (If you are under an order but have not been incarcerated within the last five years, you ARE eligible to vote unless your conviction was for election fraud.)",
    "competence":
      "You must not currently be under a judgment of interdiction for mental incompetence",
    "other": "There is no other requirement"
  },
  {
    "name": "Maine",
    "code": "ME",
    "registrationLink": "https://register.vote.org/?state=Maine",
    "age":
      "You must be 18 years old by the time of the general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Maine and the municipality in which you want to vote",
    "criminalHistory": "There is no criminal history requirement",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Maryland",
    "code": "MD",
    "registrationLink": "https://register.vote.org/?state=Maryland",
    "age": "You must be at least 18 years old by the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Maryland",
    "criminalHistory":
      "You must not have been convicted of a felony, or if you have, have completed serving a court ordered sentence of imprisonment, including any term of parole or probation for the conviction. You must not have been convicted of buying or selling votes",
    "competence": "You must not be under guardianship for mental disability",
    "other": "There is no other requirement"
  },
  {
    "name": "Massachusetts",
    "code": "MA",
    "registrationLink": "https://register.vote.org/?state=Massachusetts",
    "age": "You must be 18 years old on or before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Massachusetts",
    "criminalHistory":
      "You must not have been convicted of corrupt practices in respect to elections, You must not be currently incarcerated for a felony conviction.",
    "competence": "You must not be under guardianship with respect to voting",
    "other": "There is no other requirement"
  },
  {
    "name": "Michigan",
    "code": "MI",
    "registrationLink": "https://register.vote.org/?state=Michigan",
    "age": "You must be 18 years old by the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Michigan and at least a 30 day resident of your city or township by Election Day",
    "criminalHistory":
      "You must not be confined in a jail after being convicted and sentenced",
    "competence": "There is no competence requirement",
    "other":
      "Michigan law requires that the same address be used for voter registration and driver license purposes. Therefore, if the residence address you provide on this form differs from the address shown on a driver license or personal identification card issued by the State of Michigan, the Secretary of State will automatically change your driver license or personal identification card address to match the residence address entered on this form. If an address change is made, the Secretary of State will mail you an address update sticker for your driver license or personal identification card."
  },
  {
    "name": "Minnesota",
    "code": "MN",
    "registrationLink": "https://register.vote.org/?state=Minnesota",
    "age": "You must be at least 18 years old on Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Minnesota for 20 days before the next election. You must maintain residence at the address given on the registration form",
    "criminalHistory":
      "If you have been previously convicted of a felony; you must have completed or been discharged from your sentence",
    "competence":
      "You must not be found by a court to be legally incompetent to vote. You must not be under a court‑ordered guardianship in which the right to vote has been revoked",
    "other": "There is no other requirement"
  },
  {
    "name": "Mississippi",
    "code": "MS",
    "registrationLink": "https://register.vote.org/?state=Mississippi",
    "age":
      "You must be 18 years old by the time of the general election in which you want to vote",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must have lived in Mississippi and in your county (and city, if applicable) 30 days before Election Day",
    "criminalHistory":
      "You must have not been convicted of murder, rape, bribery, theft, arson, obtaining money or goods under false pretense, perjury, forgery, embezzlement, armed robbery, extortion, felony bad check, felony shoplifting, larceny, receiving stolen property, robbery, timber larceny, unlawful taking of a motor vehicle, statutory rape, carjacking, or bigamy, or have had your rights restored as required by law",
    "competence":
      "You must not have been declared mentally incompetent by a court",
    "other": "There is no other requirement"
  },
  {
    "name": "Missouri",
    "code": "MO",
    "registrationLink": "https://register.vote.org/?state=Missouri",
    "age": "You must be at least 17‑1/2 years of age (you must be 18 to vote)",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Missouri",
    "criminalHistory":
      "You must not be on probation or parole after conviction of a felony, until finally discharged from such probation or parole. You must not be convicted of a felony or misdemeanor connected with the right of suffrage. You must not be confined under a sentence of imprisonment.",
    "competence": "You must not be adjudged incapacitated by any court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Montana",
    "code": "MT",
    "registrationLink": "https://register.vote.org/?state=Montana",
    "age": "You must be at least 18 years old on or before Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Montana and of the county in which you want to vote for at least 30 days before the next election",
    "criminalHistory":
      "You must not be in a penal institution for a felony conviction",
    "competence":
      "You must not currently be determined by a court to be of unsound mind",
    "other":
      "You must meet these qualifications by the next Election Day if you do not currently meet them"
  },
  {
    "name": "Nebraska",
    "code": "NE",
    "registrationLink": "https://register.vote.org/?state=Nebraska",
    "age":
      "You must be at least 18 years of age or will be 18 years of age on or before the first Tuesday after the first Monday of November",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Nebraska",
    "criminalHistory":
      "You must not have been convicted of a felony, or if convicted, two years have passed since the sentence was completed (including any parole). You must not have been convicted of treason, unless you have had your civil rights stored.",
    "competence":
      "You must not have been officially found to be mentally incompetent",
    "other": "There is no other requirement"
  },
  {
    "name": "Nevada",
    "code": "NV",
    "registrationLink": "https://register.vote.org/?state=Nevada",
    "age":
      "You must have attained the age of 18 years on the date of the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must have continuously resided in the State of Nevada, in your county, at least 30 days and in your precinct at least 10 days before the next election. You must claim no other place as your legal residence",
    "criminalHistory":
      "You must have your civil rights restored if you were convicted of a felony",
    "competence":
      "You must not be determined by a court of law to be mentally incompetent",
    "other": "There is no other requirement"
  },
  {
    "name": "New Hampshire",
    "code": "NH",
    "registrationLink": "https://register.vote.org/?state=New+Hampshire",
    "age": "You must be 18 years of age or older on Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "Register to vote only in the town or ward in which you actually live",
    "criminalHistory":
      "You must not have been convicted of a felony, unless you are past your final discharge. You must not have been ever convicted of bribery or intimidation relating to elections",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "New Jersey",
    "code": "NJ",
    "registrationLink": "https://register.vote.org/?state=New+Jersey",
    "age":
      "You must be at least 18 years of age by the time of the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of this State and county at your address at least 30 days before the next election",
    "criminalHistory":
      "You must not be serving a sentence or on parole or probation as the result of a conviction of any indictable offense under the laws of this or another state or of the United States",
    "competence": "You must not be declared mentally incompetent by a court.",
    "other": "There is no other requirement"
  },
  {
    "name": "New Mexico",
    "code": "NM",
    "registrationLink": "https://register.vote.org/?state=New+Mexico",
    "age": "You must be 18 years of age at the time of the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of the State of New Mexico",
    "criminalHistory":
      "If you have been convicted of a felony, have completed all conditions of probation or parole, served the entirety of your sentence, have been granted a pardon by the Governor; or have had your conviction overturned on appeal",
    "competence":
      "You must not have been denied the right to vote by a court of law by reason of mental incapacity",
    "other": "There is no other requirement"
  },
  {
    "name": "New York",
    "code": "NY",
    "registrationLink": "https://register.vote.org/?state=New+York",
    "age":
      "You must be 18 years old by December 31 of the year you register (You must be 18 years old by the date of the general, primary, or other election in which you want to vote)",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of New York and the county, city, or village for at least 30 days before Election Day",
    "criminalHistory":
      "You must not be in jail or on parole for a felony conviction",
    "competence":
      "You must not currently be judged incompetent by a court",
    "other": "You must not claim the right to vote elsewhere"
  },
  {
    "name": "North Carolina",
    "code": "NC",
    "registrationLink": "https://register.vote.org/?state=North+Carolina",
    "age":
      "You must be 18 years of age by the day of the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of North Carolina and the precinct in which you live for at least 30 days prior to Election Day",
    "criminalHistory":
      "You must have your rights of citizenship restored if you have been convicted of a felony",
    "competence": "There is no competence requirement",
    "other": "You must not be registered or vote in any other county or state"
  },
  {
    "name": "North Dakota",
    "code": "ND",
    "registrationLink": "https://register.vote.org/?state=North+Dakota",
    "age": "You must be at least 18 years old on the day of election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must reside in the precinct for 30 days preceding Election Day",
    "criminalHistory": "There is no criminal history requirement",
    "competence": "There is no competence requirement",
    "other":
      "You must be able to provide a drivers license, non-driver identification card or other approved form of identification"
  },
  {
    "name": "Ohio",
    "code": "OH",
    "registrationLink": "https://register.vote.org/?state=Ohio",
    "age":
      "You must be at least 18 years old on or before the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Ohio for at least 30 days immediately before the election in which you want to vote",
    "criminalHistory":
      "You must not be currently incarcerated (in jail or prison) for a felony conviction. If you are an ex-felon and not currently incarcerated, you are eligible to vote in Ohio but you MUST re-register.You must not have been permanently denied the right to vote for violations of election laws.",
    "competence":
      "You must not been declared incompetent for voting purposes by a probate court",
    "other":
      "You must not been permanently denied the right to vote for violations of election laws"
  },
  {
    "name": "Oklahoma",
    "code": "OK",
    "registrationLink": "https://register.vote.org/?state=Oklahoma",
    "age":
      "You must be 18 years old on or before the date of the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of the State of Oklahoma",
    "criminalHistory":
      "You must not have been convicted of a felony, for which a period of time equal to the original sentence has not expired, or for which you have not been pardoned",
    "competence":
      "You must not now be under judgment as an incapacitated person, or a partially incapacitated person prohibited from registering to vote",
    "other": "There is no other requirement"
  },
  {
    "name": "Oregon",
    "code": "OR",
    "registrationLink": "https://register.vote.org/?state=Oregon",
    "age": "You must be at least 16 years old (to vote, you must be 18 by Election Day)",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Oregon",
    "criminalHistory": "There is no criminal history requirement",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Pennsylvania",
    "code": "PA",
    "registrationLink": "https://register.vote.org/?state=Pennsylvania",
    "age":
      "You must be at least 18 years of age on the day of the next election",
    "citizenship":
      "You must be a citizen of the United States at least one month before the next election",
    "residency":
      "You must be a resident of Pennsylvania and your election district at least 30 days before Election Day",
    "criminalHistory":
      "You must not be incarcerated after conviction for a felony (your voting rights are restored immediately after incarceration)",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "Rhode Island",
    "code": "RI",
    "registrationLink": "https://register.vote.org/?state=Rhode+Island",
    "age": "You must be 18 years old by Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Rhode Island for 30 days preceding the next election",
    "criminalHistory":
      "You must not be currently incarcerated in a correctional facility due to a felony conviction",
    "competence":
      "You must not have been lawfully judged to be mentally incompetent",
    "other": "There is no other requirement"
  },
  {
    "name": "South Carolina",
    "code": "SC",
    "registrationLink": "https://register.vote.org/?state=South+Carolina",
    "age": "You must be at least 18 years old on or before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of South Carolina, and live in the county and precinct where you are registering",
    "criminalHistory":
      "You must not be confined in any public prison resulting from a conviction of a crime. You must never have been convicted of a felony or offense against Election Day laws, or if previously convicted, have served your entire sentence, including probation or parole, or have received a pardon for the conviction",
    "competence":
      "You must not be under a court order declaring you mentally incompetent",
    "other": "There is no other requirement"
  },
  {
    "name": "South Dakota",
    "code": "SD",
    "registrationLink": "https://register.vote.org/?state=South+Dakota",
    "age": "You must be 18 years old by the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must reside in South Dakota",
    "criminalHistory":
      "You must not be currently serving a sentence for a felony conviction which included imprisonment, served or suspended, in an adult penitentiary system",
    "competence":
      "You must not have been adjudged mentally incompetent by a court",
    "other": "There is no other requirement"
  },
  {
    "name": "Tennessee",
    "code": "TN",
    "registrationLink": "https://register.vote.org/?state=Tennessee",
    "age": "You must be at least 18 years old on or before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Tennessee",
    "criminalHistory":
      "You must not have been convicted of a felony, or if convicted, have had your full rights of citizenship restored (or have received a pardon)",
    "competence":
      "You must not be adjudicated incompetent by a court of competent jurisdiction (or have been restored to legal capacity)",
    "other": "There is no other requirement"
  },
  {
    "name": "Texas",
    "code": "TX",
    "registrationLink": "https://register.vote.org/?state=Texas",
    "age":
      "You must be at least 17 years and 10 months old (you must be 18 to vote)",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of the county in which the application for registration is made",
    "criminalHistory":
      "You must not be finally convicted of a felony, or if a convicted felon, you must have fully discharged your punishment, including any incarceration, parole, supervision, period of probation, or be pardoned",
    "competence":
      "You must have not been declared mentally incompetent by final judgment of a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Utah",
    "code": "UT",
    "registrationLink": "https://register.vote.org/?state=Utah",
    "age": "You must be at least 18 years old on or before the next election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must have resided in Utah for 30 days immediately before the next election",
    "criminalHistory":
      "You must not be a convicted felon currently incarcerated for commission of a felony. You must not be convicted of treason or crime against the elective franchise, unless restored to civil rights",
    "competence":
      "You must not be found to be mentally incompetent by a court of law",
    "other": "There is no other requirement"
  },
  {
    "name": "Vermont",
    "code": "VT",
    "registrationLink": "https://register.vote.org/?state=Vermont",
    "age": "You must be 18 years of age on or before Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of Vermont",
    "criminalHistory": "There is no criminal history requirement",
    "competence": "There is no competence requirement",
    "other":
      "You must have taken the Voter’s Oath in accordance with the Vermont Constitution: \"You solemnly swear (or affirm) that whenever you give your vote or suffrage, touching any matter that concerns the state of Vermont, you will do it so as in your conscience you shall judge will most conduce to the best good of the same, as established by the Constitution, without fear or favor of any person.\""
  },
  {
    "name": "Virginia",
    "code": "VA",
    "registrationLink": "https://register.vote.org/?state=Virginia",
    "age": "You must be 18 years old by the next general election",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Virginia and of the precinct in which you want to vote",
    "criminalHistory":
      "You must not have been convicted of a felony, or have had your civil rights restored",
    "competence":
      "You must not currently be declared incapacitated by a court",
    "other": "There is no other requirement"
  },
  {
    "name": "Washington",
    "code": "WA",
    "registrationLink": "https://register.vote.org/?state=Washington",
    "age": "You must be at least 18 years old by Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a legal resident of Washington State, your county, and precinct for 30 days immediately preceding Election Day",
    "criminalHistory":
      "You must not be disqualified from voting due to a court order. You must not be under Department of Corrections supervision for a Washington felony conviction.",
    "competence": "There is no competence requirement",
    "other": "There is no other requirement"
  },
  {
    "name": "West Virginia",
    "code": "WV",
    "registrationLink": "https://register.vote.org/?state=West+Virginia",
    "age":
      "You must be 18 years old, or to vote in the primary be 17 years old and turning 18 before the general election",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must live in West Virginia in the county in which you are registering",
    "criminalHistory":
      "You must not be under conviction, probation, or parole for a felony, treason, or election bribery",
    "competence":
      "You must not have been judged \"mentally incompetent\" in a court of competent jurisdiction",
    "other": "There is no other requirement"
  },
  {
    "name": "Wisconsin",
    "code": "WI",
    "registrationLink": "https://register.vote.org/?state=Wisconsin",
    "age": "You must be 18 years old",
    "citizenship": "You must be a citizen of the United States",
    "residency":
      "You must be a resident of Wisconsin for at least 10 days",
    "criminalHistory":
      "You must not have been convicted of treason, felony or bribery, or if you have, your civil rights have been restored",
    "competence": "You must not be incapable of understanding the objective of the elective process or under guardianship",
    "other": "There is no other requirement"
  },
  {
    "name": "Wyoming",
    "code": "WY",
    "registrationLink": "https://register.vote.org/?state=Wyoming",
    "age": "You must be 18 years old by General Election Day",
    "citizenship": "You must be a citizen of the United States",
    "residency": "You must be a resident of the State of Wyoming",
    "criminalHistory":
      "You must not have been convicted of a felony, or if convicted have had your voting rights restored",
    "competence": "You must not be currently adjudicated mentally incompetent",
    "other": "You must re-register to vote if you did not vote in the last general election."
  }
]
